{
  "ir_version": "1.0",
  "project": "traffic2openapi",
  "repository": "https://github.com/grokify/traffic2openapi",
  "versioning": "semver",
  "commit_convention": "conventional",
  "releases": [
    {
      "version": "v0.1.0",
      "date": "2026-01-08",
      "highlights": [
        { "description": "Generate OpenAPI 3.0/3.1/3.2 specifications from HTTP traffic logs captured via HAR files, proxy captures, or test automation" },
        { "description": "Multi-source traffic capture with adapters for HAR files, Playwright, Go http.Client, and proxy logs" },
        { "description": "Intelligent inference engine with path parameter detection, schema inference, and security/pagination/rate-limit detection" },
        { "description": "CLI tools for spec management: diff, merge, serve, and static site generation" }
      ],
      "added": [
        { "description": "IR (Intermediate Representation) JSON Schema v1 for HTTP traffic records" },
        { "description": "`pkg/ir` package with types, batch/NDJSON I/O, and streaming support" },
        { "description": "`pkg/har` package for HAR file parsing and conversion" },
        { "description": "`pkg/inference` engine for path template and JSON Schema inference" },
        { "description": "`pkg/openapi` generator supporting OpenAPI 3.0.3, 3.1.0, and 3.2.0" },
        { "description": "`pkg/sitegen` package for static HTML documentation site generation" },
        { "description": "`traffic2openapi` CLI with `convert`, `generate`, and `validate` commands" },
        { "description": "`merge` command for combining multiple IR files or OpenAPI specs with deduplication" },
        { "description": "`diff` command for comparing OpenAPI specs with breaking change detection" },
        { "description": "`serve` command for interactive documentation with Swagger UI or Redoc" },
        { "description": "`site` command for generating static HTML documentation from traffic logs" },
        { "description": "Watch mode for `generate` command with file change auto-regeneration" },
        { "description": "Path parameter detection for UUIDs, numeric IDs, hashes, and dates" },
        { "description": "Context-aware path parameter naming with 180+ resource patterns" },
        { "description": "Format detection for email, UUID, date-time, URI, IPv4, and IPv6" },
        { "description": "Required vs optional field tracking across multiple requests" },
        { "description": "Security scheme detection for Bearer (with JWT), Basic auth, and API keys" },
        { "description": "Pagination pattern detection for page/limit and cursor-based patterns" },
        { "description": "Rate limit header detection (X-RateLimit-*, Retry-After)" },
        { "description": "Sensitive header filtering (authorization, cookies, API keys)" },
        { "description": "Playwright adapters for Python and TypeScript" },
        { "description": "LoggingTransport for capturing HTTP traffic from Go http.Client" }
      ],
      "documentation": [
        { "description": "README with quick start, architecture diagram, and API usage examples" },
        { "description": "Browser capture guide for Playwright, Cypress, and DevTools" },
        { "description": "MkDocs documentation site with comprehensive guides" }
      ],
      "tests": [
        { "description": "Unit tests for IR, inference, OpenAPI, and HAR packages" }
      ]
    }
  ]
}
