{
  "irVersion": "1.0",
  "project": "traffic2openapi",
  "repository": "https://github.com/grokify/traffic2openapi",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-03-14",
      "highlights": [
        { "description": "Fluent builder API for constructing OpenAPI 3.x specifications programmatically" },
        { "description": "libopenapi-based spec validation with detailed error reporting" },
        { "description": "Multi-version output generation (3.0.3, 3.1.0, 3.2.0) with automatic version conversion" }
      ],
      "added": [
        { "description": "`pkg/openapibuilder` package with fluent builder API for OpenAPI spec construction", "commit": "eefff59" },
        { "description": "`pkg/openapi/validate` package for OpenAPI specification validation using libopenapi", "commit": "1e641e5" },
        { "description": "`pkg/openapi/convert` package for multi-version OpenAPI spec conversion", "commit": "23232b7" },
        { "description": "`validate-spec` CLI command for validating OpenAPI specification files", "commit": "1e641e5" },
        { "description": "`--versions` flag for generating multiple OpenAPI versions simultaneously (comma-separated: 3.0,3.1,3.2)", "commit": "5f25721" },
        { "description": "`--all-versions` flag for generating all supported OpenAPI versions (3.0.3, 3.1.0, 3.2.0)", "commit": "5f25721" },
        { "description": "Built-in validation for generated specs (enabled by default)", "commit": "5f25721" },
        { "description": "`--skip-validation` flag to skip spec validation during generation", "commit": "5f25721" },
        { "description": "Version-aware nullable handling (OpenAPI 3.0 nullable keyword vs 3.1+ type arrays)", "commit": "eefff59" },
        { "description": "OAuth2 flow builders for authorization_code, client_credentials, implicit, and password flows", "commit": "eefff59" }
      ],
      "documentation": [
        { "description": "Restructure documentation for GitHub Pages (move markdown source to docs/)", "commit": "da69b22" },
        { "description": "`examples/validation/` demonstrating spec validation with libopenapi", "commit": "1e641e5" },
        { "description": "`examples/builder/` demonstrating fluent builder API", "commit": "eefff59" },
        { "description": "`examples/multiversion/` demonstrating multi-version output", "commit": "23232b7" }
      ],
      "tests": [
        { "description": "Additional tests for validate, convert, openapibuilder, and har packages", "commit": "9e23420" }
      ],
      "dependencies": [
        { "description": "Add `github.com/pb33f/libopenapi` for OpenAPI parsing and validation", "commit": "e5e30ec" },
        { "description": "Update `github.com/grokify/omnistorage` to v0.2.2", "commit": "f6d02fe" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-02-07",
      "highlights": [
        { "description": "Generate OpenAPI 3.0/3.1/3.2 specifications from HTTP traffic logs captured via HAR files, proxy captures, or test automation" },
        { "description": "Multi-source traffic capture with adapters for HAR files, Playwright, Go http.Client, and proxy logs" },
        { "description": "Intelligent inference engine with path parameter detection, schema inference, and security/pagination/rate-limit detection" },
        { "description": "CLI tools for spec management: diff, merge, serve, and static site generation" }
      ],
      "added": [
        { "description": "IR (Intermediate Representation) JSON Schema v1 for HTTP traffic records", "commit": "d730b1e" },
        { "description": "`pkg/ir` package with types, batch/NDJSON I/O, and streaming support", "commit": "65166ae" },
        { "description": "`pkg/har` package for HAR file parsing and conversion", "commit": "724d660" },
        { "description": "`pkg/inference` engine for path template and JSON Schema inference", "commit": "73ef018" },
        { "description": "`pkg/openapi` generator supporting OpenAPI 3.0.3, 3.1.0, and 3.2.0", "commit": "328d741" },
        { "description": "`pkg/sitegen` package for static HTML documentation site generation", "commit": "9b0ecda" },
        { "description": "`traffic2openapi` CLI with `convert`, `generate`, and `validate` commands", "commit": "5040d62" },
        { "description": "`merge` command for combining multiple IR files or OpenAPI specs with deduplication", "commit": "5040d62" },
        { "description": "`diff` command for comparing OpenAPI specs with breaking change detection", "commit": "5040d62" },
        { "description": "`serve` command for interactive documentation with Swagger UI or Redoc", "commit": "5040d62" },
        { "description": "`site` command for generating static HTML documentation from traffic logs", "commit": "5040d62" },
        { "description": "Watch mode for `generate` command with file change auto-regeneration", "commit": "5040d62" },
        { "description": "Path parameter detection for UUIDs, numeric IDs, hashes, and dates", "commit": "73ef018" },
        { "description": "Context-aware path parameter naming with 180+ resource patterns", "commit": "73ef018" },
        { "description": "Format detection for email, UUID, date-time, URI, IPv4, and IPv6", "commit": "73ef018" },
        { "description": "Required vs optional field tracking across multiple requests", "commit": "73ef018" },
        { "description": "Security scheme detection for Bearer (with JWT), Basic auth, and API keys", "commit": "73ef018" },
        { "description": "Pagination pattern detection for page/limit and cursor-based patterns", "commit": "73ef018" },
        { "description": "Rate limit header detection (X-RateLimit-*, Retry-After)", "commit": "73ef018" },
        { "description": "Sensitive header filtering (authorization, cookies, API keys)", "commit": "73ef018" },
        { "description": "Playwright adapters for Python and TypeScript", "commit": "eb722cd" },
        { "description": "LoggingTransport for capturing HTTP traffic from Go http.Client", "commit": "65166ae" }
      ],
      "documentation": [
        { "description": "README with quick start, architecture diagram, and API usage examples", "commit": "2c9ad34" },
        { "description": "Browser capture guide for Playwright, Cypress, and DevTools", "commit": "05a0463" },
        { "description": "MkDocs documentation site with comprehensive guides", "commit": "05a0463" }
      ],
      "tests": [
        { "description": "Unit tests for IR, inference, OpenAPI, and HAR packages", "commit": "65166ae" }
      ],
      "build": [
        { "description": "GitHub Actions CI workflow with cross-platform testing (Linux, macOS, Windows)", "commit": "cd7340f" },
        { "description": "golangci-lint workflow for static analysis", "commit": "cd7340f" },
        { "description": "CodeQL SAST workflow for security scanning", "commit": "cd7340f" },
        { "description": "Playwright adapters workflow for Python and TypeScript adapter testing", "commit": "cd7340f" },
        { "description": "Dependabot configuration for automated dependency updates", "commit": "cd7340f" }
      ]
    }
  ]
}
